[
    "Article 1 (Purpose)\nThe purpose of these regulations is to stipulate the necessary details regarding the Undergraduate-Graduate Integrated Program (hereinafter referred to as the 'Integrated Program') as delegated by the Sogang University Academic Regulations and the Graduate School Academic Regulations.\nArticle 2 (Duration of Study)\nThe Integrated Program allows for the reduction of the duration of study for the bachelor's degree, master's degree, and integrated master's-doctoral degree by up to one year each.\nArticle 3 (Eligibility for Application)\nTo apply for the Integrated Program, applicants must meet all of the following qualifications:\n1. Completed Credits:\n    - After completing 4 semesters: at least 64 credits\n    - After completing 5 semesters: at least 80 credits\n    - After completing 6 semesters: at least 95 credits\n    - After completing 7 semesters: at least 110 credits\n    \n    *(Credits from seasonal sessions in the application semester are not included.)*",
    "- After completing 7 semesters: at least 110 credits\n    \n    *(Credits from seasonal sessions in the application semester are not included.)*\n    \n2. A cumulative GPA of 3.3 or higher up to the application semester.\n3. Recommendations from the head of the applicant's undergraduate department and the advisor of the intended graduate department.\n4. The Integrated Program should ideally be between the same undergraduate and graduate departments. However, if selecting a related or interdisciplinary graduate department, additional recommendation from the head of the respective graduate department is required.\nArticle 4 (Required Documents)\nApplicants must submit the following documents:\n1. One copy of the Integrated Program Application Form.\n2. One copy of the undergraduate academic transcript.\n3. One copy of the research plan.\n4. One copy of the recommendation letter from the graduate advisor.\nArticle 5 (Selection Process)",
    "2. One copy of the undergraduate academic transcript.\n3. One copy of the research plan.\n4. One copy of the recommendation letter from the graduate advisor.\nArticle 5 (Selection Process)\nSelection is conducted through document screening, which comprehensively evaluates undergraduate grades, research plans, recommendation letters, and other criteria set by the department.\nArticle 6 (Number of Admissions)\nThe number of admissions for the Integrated Program is limited to within 30% of the admission quota for the master's degree program.\nArticle 7 (Course Registration and Credit Recognition)\nFor students selected for the Integrated Program, course registration and credit recognition are as follows:\n1. Students may register for up to 3 additional credits per semester until undergraduate graduation. Graduate courses, including shared undergraduate-graduate courses, can be taken up to 6 credits per semester.",
    "2. A total of up to 12 credits of graduate courses, including shared undergraduate-graduate courses, can be completed before undergraduate graduation. However, graduate courses, excluding shared courses, are not recognized as undergraduate graduation credits.\n3. Upon entering the graduate program through the Integrated Program, students may have up to 12 credits of graduate courses, including shared courses, completed during undergraduate studies recognized as graduate credits, provided they have achieved a grade of B0 or higher and obtained approval from the department head. However, only up to 9 credits of shared courses can be recognized.\nArticle 8 (Registration and Disqualification)\n1. Students who fail to meet undergraduate graduation requirements by the end of the 7th semester or have a cumulative GPA below 3.3 by the end of the 7th semester must register for the 8th semester (4th year, 2nd semester).",
    "2. If undergraduate graduation requirements are not met even after completing the 8th semester, the eligibility for the Integrated Program admission is forfeited.\nArticle 9 (Undergraduate Graduation)\nStudents who meet undergraduate graduation requirements must submit the Integrated Program Graduation Application Form and the graduate school application form during the designated period in the 7th or 8th semester.\nArticle 10 (Benefits of the Integrated Program)\nStudents selected for the Integrated Program are granted the following benefits:\n1. Priority may be given in the allocation of undergraduate and graduate scholarships.\n2. Opportunities to participate in various research projects of the graduate school during undergraduate studies.\n3. Admission to the graduate school is conducted through document screening.\n4. Exemption from the graduate school admission fee and the first semester tuition. However, this does not apply if other scholarships are received.\nArticle 11 (Miscellaneous)",
    "4. Exemption from the graduate school admission fee and the first semester tuition. However, this does not apply if other scholarships are received.\nArticle 11 (Miscellaneous)\nMatters not specified in these regulations shall be governed by the university's academic regulations and related rules.\nSupplementary Provisions (2023.5.23.)\n1. (Effective Date) These regulations shall take effect from May 24, 2023.\n2. (Transitional Measures) Actions taken prior to the implementation of these regulations shall be considered as having been conducted under these regulations."
]